// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22
// 1ое решение задачи

int a = 22;
int b = 3;
int c = 9;

int max = a; 

if (max > b)
{
  max = max;
}
else
{
  max = b;
}

if (max > c)
{
  max = max;
}
else
{
  max = c;
}

Console.WriteLine (max);



// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел.
// 2, 3, 7 -> 7
// 44 5 78 -> 78
// 22 3 9 -> 22
//2ое решение задачи

//int a = 2;
//int b = 3;
//int c = 7;

//int max = a; 

//if (max > b)
//{
 // if (max > c)
  //{
    //Console.WriteLine (max);
  //}
  //else
  //{
    //max = c;
    //Console.WriteLine (max);
  //}
//}
//else
//{
  //max = b;
//}

//if (max > c)
//{
  //Console.WriteLine (max);
//}
//else
//{
  //max = c;
  //Console.WriteLine (max);
//}

