
# Домашнее задание к семинару 1

## 4) Задача 8: Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N. 
5 -> 2,4
8 -> 2, 4, 6, 8

[Блок-схемы](diagram4.drawio.png) | [КОД](Program.cs) 

## !!!Нужно разобраться!!!
PS: основа проги ниже. проблемс - хз как конвертнуть введеное число 

int N = 8;
var A = 2;

while (A <= N)
{
  Console.WriteLine(A);
  A = A + 2;
}


!!!Нужно разобраться!!!